ConnectTest/src/Catalogs/errorDescriptions/errorDescriptions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>errorDescriptions</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>translation</name>
    <attributes>
      <name>language</name>
      <type>
        <types>CatalogRef.languages</types>
      </type>
    </attributes>
    <attributes>
      <name>description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/Catalogs/errorDescriptions/ManagerModule.bsl
Function attributesStructure() Export

	attributesTable = data.getValueTable();
	attributesTableForNewItem = data.getValueTable();

	data.addRowInAttributesTable(attributesTable, "code", "code", "string");
	data.addRowInAttributesTable(attributesTable, "parent", "parent", "ref");
	data.addRowInAttributesTable(attributesTable, "translation", "translation", "valueTable");

	parentStruct = New Structure();
	parentStruct.Insert("errorDescriptions", "uid");

	attributesTranslation = data.getValueTable();

	data.addRowInAttributesTable(attributesTranslation, "language", "language", "ref");
	data.addRowInAttributesTable(attributesTranslation, "description", "description", "string");
		
	mdStruct = New Structure();
	mdStruct.Insert("translation", attributesTranslation);
	mdStruct.Insert("parent", parentStruct);
	mdStruct.Insert("language", New Structure("languages", "code"));
	
	Return New Structure("fillHolding, mdObjectName, mdType, actType, attributesTable, attributesTableForNewItem, mdStruct", False, "errorDescriptions", "catalog", "write", attributesTable, attributesTableForNewItem, mdStruct);

EndFunction
